<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="fr">
<TITLE>L'informatique au lyc&eacute;e&nbsp;: rentr&eacute;e 2010 et rentr&eacute;e 2012</TITLE>
<META NAME="Author" CONTENT="Jean-Pierre Archambault">
<META NAME="Copyright" CONTENT="Association EPI">
<META NAME="publisher" CONTENT="EpiNet 125">
<META NAME="Ref-epi" CONTENT="a1005a">
<META NAME="Classification" CONTENT="ENSEIGNEMENT, INFORMATIQUE, TICE, FORMATION">
<META NAME="subject" CONTENT="">
<META NAME="keywords" CONTENT="EPI, ENSEIGNEMENT, INFORMATIQUE, TICE, Editorial">
<STYLE TYPE="text/css">
a:link {text-decoration: none;color: #0000FF;}
a:visited {text-decoration: none;color: #0000DD;}
a:hover {text-decoration: underline; color: #0000FF;}
</STYLE>
</HEAD>
<BODY TEXT="#003090" BGCOLOR="#FFFFFB">


<!-- AK 07/05/2010 -->

<A NAME="HAUT"></A><A NAME="DEBUT"></A>

<CENTER><TABLE BORDER=0 WIDTH="90%">
<TR>
<TD>


<P ALIGN="CENTER"><FONT SIZE=5><B>L'informatique au lyc&eacute;e&nbsp;: rentr&eacute;e 2010 et rentr&eacute;e 2012</B></FONT></P>
<P ALIGN="CENTER"><FONT SIZE=5><I><B>Enseignement de sp&eacute;cialit&eacute; <BR>
&laquo;&nbsp;informatique et sciences du num&eacute;rique&nbsp;&raquo; en&nbsp;Terminale&nbsp;S <BR>
&agrave; la rentr&eacute;e 2012&nbsp;: la formation des professeurs</B></I></FONT></P>
<P ALIGN="CENTER"><FONT SIZE=5><I><B>L'informatique dans les enseignements d'exploration de&nbsp;seconde <BR>
&agrave; la rentr&eacute;e 2010<BR>
&nbsp;</B></I></FONT></P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;<A NAME="Appel_Note1"></A>Suite &agrave; leur audience&nbsp;<A HREF="l-informatique-au-lycee--2011.html#Note1">[1]</A> avec &Eacute;rick Roser, Conseiller du Ministre de l'&Eacute;ducation nationale pour les affaires p&eacute;dagogiques et Beno&icirc;t Labrousse, Conseiller technique (nouvelles technologies, &eacute;diteurs, multim&eacute;dia), le lundi 22 mars 2010, au nom de l'EPI et du groupe ITIC de l'ASTI (Association Fran&ccedil;aise des Sciences et Technologies de l'Information et de la Communication)&nbsp;:<A NAME="Appel_Note2"></A> Jean-Pierre Archambault, G&eacute;rard Berry, Gilles Dowek et Maurice Nivat ont &eacute;labor&eacute; une proposition de programme pour la formation des professeurs qui seront charg&eacute;s de l'enseignement de sp&eacute;cialit&eacute; optionnel &laquo;&nbsp;Informatique et sciences du num&eacute;rique&nbsp;&raquo; en Terminale S &agrave; la rentr&eacute;e 2012&nbsp;<A HREF="l-informatique-au-lycee--2011.html#Note2">[2]</A>. Ce texte a &eacute;t&eacute; discut&eacute; avec les groupes ITIC de l'ASTI et de l'EPI, avec des membres de l'association SPECIF qui f&eacute;d&egrave;re la communaut&eacute; des enseignants en informatique &agrave; l'Universit&eacute;, ainsi qu'avec plusieurs autres coll&egrave;gues enseignants et/ou chercheurs. </P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;Cette proposition de programme correspond aux connaissances informatiques qui doivent &ecirc;tre ma&icirc;tris&eacute;es par un enseignant de la discipline informatique au lyc&eacute;e. Il comporte les quatre domaines qui constituent l'informatique&nbsp;: information, langage, algorithmique et machine. La formation des enseignants devrait commencer &agrave; la rentr&eacute;e 2010 dans un certain nombre d'universit&eacute;s. Ses modalit&eacute;s concr&egrave;tes sont en cours d'examen. Cette formation donnera lieu &agrave; validation pour l'obtention d'une &laquo;&nbsp;certification compl&eacute;mentaire&nbsp;&raquo; &agrave; laquelle pourront aussi pr&eacute;tendre des enseignants ayant d&eacute;j&agrave; le niveau requis, sans qu'ils aient &agrave; suivre les formations propos&eacute;es. Le proposition de programme comprend quelques questions sur la sp&eacute;cificit&eacute; de la p&eacute;dagogie de l'informatique au lyc&eacute;e. Nous y reviendrons.</P>
<P ALIGN="CENTER">*<BR>
*&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;*</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;<A NAME="Appel_Note3"></A>Les programmes des enseignements d'exploration en classe de seconde qui entreront en vigueur &agrave; la rentr&eacute;e 2010 ont &eacute;t&eacute; publi&eacute;s&nbsp;<A HREF="l-informatique-au-lycee--2011.html#Note3">[3]</A>.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;<A NAME="Appel_Note4"></A>Parmi ceux-ci figurent &laquo;&nbsp;Sciences de l'ing&eacute;nieur en classe de seconde g&eacute;n&eacute;rale et technologique&nbsp;&raquo;. L'informatique y occupe une place&nbsp;<A HREF="l-informatique-au-lycee--2011.html#Note4">[4]</A>. Une bonne chose, m&ecirc;me si on peut penser que la place e&ucirc;t pu &ecirc;tre plus importante quand on se souvient du rapport du SNRI qui indiquait en 2009&nbsp;: <I>&laquo;&nbsp;<A NAME="Appel_Note5"></A>La majorit&eacute; des ing&eacute;nieurs et chercheurs non informaticiens n'acqui&egrave;rent pendant leur cursus qu'un bagage limit&eacute; au regard de ce que l'on observe dans les autres disciplines. Pourtant, ils utiliseront ou pourront avoir &agrave; d&eacute;cider de l'utilisation d'outils informatiques sophistiqu&eacute;s. Il est &agrave; craindre qu'ils ne le feront pas avec un rendement optimal ou que, en position de responsabilit&eacute;, ils sous-estimeront l'importance du secteur&nbsp;&raquo;</I>&nbsp;<A HREF="l-informatique-au-lycee--2011.html#Note5">[5]</A>. En effet, l'informatique est partout dans l'entreprise. Des syst&egrave;mes de contr&ocirc;le informatis&eacute;s font fonctionner les processus industriels. Les m&eacute;tiers de l'informatique, et ceux des t&eacute;l&eacute;communications, occupent une place importante dans les services. On ne compte plus les objets mat&eacute;riels qui sont remplis de puces &eacute;lectroniques...</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;<A NAME="Appel_Note6"></A>Autre enseignement d'exploration &laquo;&nbsp;M&eacute;thodes et pratiques scientifiques&nbsp;&raquo;&nbsp;<A HREF="l-informatique-au-lycee--2011.html#Note6">[6]</A>. L&agrave; aussi, l'informatique y tient une place. Normal quand on sait que c'est l'informatique, pour ne prendre que ces exemples, qui a r&eacute;cemment fait faire de tr&egrave;s spectaculaires progr&egrave;s &agrave; l'imagerie m&eacute;dicale et qui permet ceux de la g&eacute;n&eacute;tique. L'informatique modifie progressivement, et de mani&egrave;re irr&eacute;versible, notre mani&egrave;re de poser et de r&eacute;soudre les questions dans quasiment toutes les sciences exp&eacute;rimentales ou th&eacute;oriques qui ne peuvent se concevoir aujourd'hui sans ordinateurs et r&eacute;seaux.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;Dans l'enseignement d'exploration &laquo;&nbsp;Cr&eacute;ation et innovation technologiques&nbsp;&raquo;, sont mentionn&eacute;s des &laquo;&nbsp;principes qui r&eacute;gissent la propri&eacute;t&eacute; intellectuelle, la normalisation...&nbsp;&raquo;, l'&laquo;&nbsp;analyse de la valeur d'un produit, brevets et normes&nbsp;&raquo;, soit des domaines o&ugrave; l'informatique a profond&eacute;ment modifi&eacute; les probl&eacute;matiques (que l'on pense aux logiciels libres). Juristes, architectes, &eacute;crivains, musiciens, stylistes, photographes, m&eacute;decins, pour ne citer qu'eux, sont, comme les ing&eacute;nieurs, concern&eacute;s.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;De quoi contribuer &agrave; favoriser la motivation des &eacute;l&egrave;ves pour l'informatique et susciter chez eux des vocations pour son enseignement en tant que tel.</P>
<P ALIGN="RIGHT">Le 12 mai 2010</P>
<P ALIGN="RIGHT">Jean-Pierre Archambault<BR>
Pr&eacute;sident de l'EPI</P>

<P><B>NOTES</B></P>
<P><A NAME="Note1" HREF="l-informatique-au-lycee--2011.html#Appel_Note1">[1]</A>&nbsp;Communiqu&eacute; de l'EPI&nbsp;: <A HREF="http://www.epi.asso.fr/revue/docu/d1004a.htm" TARGET="_blank">http://www.epi.asso.fr/revue/docu/d1004a.htm</A>.</P>
<P><A NAME="Note2" HREF="l-informatique-au-lycee--2011.html#Appel_Note2">[2]</A>&nbsp;Groupes ITIC de l'Asti et de l'EPI, <A HREF="http://www.epi.asso.fr/revue/editic/asti-itic-prog-prof_1004.htm" TARGET="_blank">Proposition de programme de formation pour les enseignants charg&eacute;s de la sp&eacute;cialit&eacute; <I>Informatique et sciences du num&eacute;rique</I> en&nbsp;terminale&nbsp;S</A>.<BR>
<A HREF="http://www.epi.asso.fr/revue/editic/asti-itic-prog-prof_1004.pdf" TARGET="_blank">http://www.epi.asso.fr/revue/editic/asti-itic-prog-prof_1004.pdf</A>.</P>
<P><A NAME="Note3" HREF="l-informatique-au-lycee--2011.html#Appel_Note3">[3]</A>&nbsp;<I><A HREF="http://www.epi.asso.fr/revue/lu/l1005l.htm" TARGET="_blank">Bulletin officiel sp&eacute;cial n&deg;4</A></I> du 29 avril 2010.<BR>
<A HREF="http://www.education.gouv.fr/pid23972/special-n-4-du-29-avril-2010.html" TARGET="_blank">http://www.education.gouv.fr/pid23972/special-n-4-du-29-avril-2010.html</A>.</P>
<P ALIGN="JUSTIFY"><A NAME="Note4" HREF="l-informatique-au-lycee--2011.html#Appel_Note4">[4]</A>&nbsp;On peut notamment y lire que <I>&laquo;&nbsp;les activit&eacute;s propos&eacute;es visent &agrave; explorer comment exploiter des mod&eacute;lisations et des simulations num&eacute;riques...&nbsp;&raquo;</I> ou que <I>&laquo;&nbsp;cette exigence d'ing&eacute;nierie simultan&eacute;e gagne &agrave; utiliser des produits informatiques sp&eacute;cifiques, permettant d'associer, dans un m&ecirc;me environnement, des bases de donn&eacute;es, des outils de conception, de repr&eacute;sentation, de calcul et de simulation. L'utilisation de logiciels de CAO et de leur environnement de calcul et l'utilisation de maquettes num&eacute;riques existantes facilitent les activit&eacute;s de d&eacute;codage et permettent de proposer des modifications simples de produits existants&nbsp;&raquo;</I>.</P>
<P><A NAME="Note5" HREF="l-informatique-au-lycee--2011.html#Appel_Note5">[5]</A>&nbsp;<A HREF="http://www.epi.asso.fr/revue/lu/l1005o.htm" TARGET="_blank">Rapport du groupe &laquo;&nbsp;Num&eacute;rique, calcul intensif et math&eacute;matiques&nbsp;&raquo;</A>. Les sciences du num&eacute;rique englobent notament&nbsp;: l'informatique, l'automatique, la robotique, le traitement du signal et des images...<BR>
<A HREF="http://www.enseignementsup-recherche.gouv.fr/cid28982/snri-les-rapports-des-groupes-de-travail.html" TARGET="_blank">http://www.enseignementsup-recherche.gouv.fr/cid28982/snri-les-rapports-des-groupes-de-travail.html</A>.</P>
<P ALIGN="JUSTIFY"><A NAME="Note6" HREF="l-informatique-au-lycee--2011.html#Appel_Note6">[6]</A>&nbsp;Il est notamment question de stockage et gestion de donn&eacute;es, de cryptologie, d'enregistrement des documents sonores (encodage, &eacute;chantillonnage...), du passage de l'argentique au num&eacute;rique, du codage et de la compression des images...<BR>
<A HREF="http://media.enseignementsup-recherche.gouv.fr/file/Defi_de_connaissance_pluridisciplinaire/97/5/SNRI2009_rapport_groupe_de_travail_Nummath_65975.pdf" TARGET="_blank">http://media.enseignementsup-recherche.gouv.fr/file/Defi_de_connaissance_pluridisciplinaire/97/5/SNRI2009_rapport_groupe_de_travail_Nummath_65975.pdf</A>.</P>
<P><FONT SIZE=2>___________________<BR>
Association EPI<BR>
Mai 2010</FONT></P>


</TD>
</TR>
</TABLE>
</CENTER>

<A NAME="BAS"></A><A NAME="FIN"></A>

<P><CENTER><TABLE BORDER=3 CELLSPACING=3 CELLPADDING=10>
<TR><TD>
<A HREF="http://www.epi.asso.fr/accueil.htm"><IMG SRC="http://www.epi.asso.fr/epired.gif" WIDTH=47 HEIGHT=36 BORDER=0 ALT="Accueil" ALIGN="BOTTOM"></A>
<!--
</TD><TD>
<A HREF="../docsom.htm#a1005a">Rapports et Documents</A>
</TD><TD>
<A HREF="../editic.htm#a1005a">Informatique et TIC</A>
</TD><TD>
<A HREF="../../linux0.htm#a1005a">Linux et Logiciels libres</A>
-->
</TD><TD>
<A HREF="http://www.epi.asso.fr/revue/articsom.htm#a1005a">Articles</A>
</TD></TR>
</TABLE></CENTER>

</BODY>
</HTML>


