<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="fr">
<TITLE>L'informatique au collège</TITLE>
<META NAME="Author" CONTENT="Émilien Pélisset, Michel Devaud">
<META NAME="Copyright" CONTENT="Association EPI">
<META NAME="publisher" CONTENT="EpiNet 54">
<META NAME="Ref-epi" CONTENT="d04p005">
<META NAME="Classification" CONTENT="ENSEIGNEMENT, INFORMATIQUE, TICE, FORMATION">
<META NAME="subject" CONTENT="">
<META NAME="keywords" CONTENT="EPI, ENSEIGNEMENT, INFORMATIQUE, TICE">
<STYLE TYPE="text/css">
a:link {text-decoration: none;color: #0000FF;}
a:visited {text-decoration: none;color: #0000DD;}
a:hover {text-decoration: underline; color: #0000FF;}
</STYLE>
</HEAD>
<BODY TEXT="#003090" BGCOLOR="#FFFFFB">

<!AK 03/03/2003>

<CENTER><TABLE BORDER=0 WIDTH="90%" >
<TR>
<TD>


<P ALIGN="CENTER"><FONT SIZE=5><B>L'INFORMATIQUE AU COLL&Egrave;GE</B></FONT></P>
<P ALIGN="CENTER"><FONT SIZE=5><B>Introduction et &eacute;l&eacute;ments pour un historique</B></FONT></P>
<P ALIGN="CENTER"><FONT SIZE=4><B>Dossier EPI n&deg;&nbsp;4,<BR>
suppl&eacute;ment au Bulletin de mars 1984<BR>
&nbsp;</B></FONT></P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;L'E.P.I. a toujours consid&eacute;r&eacute; l'informatique p&eacute;dagogique comme un outil de d&eacute;cloisonnement, de d&eacute;s&eacute;gr&eacute;gation&nbsp;; elle a souvent d&eacute;plor&eacute; les cons&eacute;quences de la rigide stratification des niveaux et des disciplines d'enseignement, comme celles des directions p&eacute;dagogiques horizontales au Minist&egrave;re. &Agrave; premi&egrave;re vue, il semble donc paradoxal, sinon contradictoire, d'avoir mis en place une Commission COLL&Egrave;GES et de publier un dossier intitul&eacute; <I>L'informatique au Coll&egrave;ge</I>. Mais les justifications ne manquent pas.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;L'histoire fran&ccedil;aise de l'introduction de l'informatique dans l'enseignement a privil&eacute;gi&eacute; les lyc&eacute;es. Pourtant, d&egrave;s les origines, la place tenue par les ma&icirc;tres puis par les &eacute;l&egrave;ves des coll&egrave;ges a &eacute;t&eacute; importante&nbsp;; elle est le plus souvent ignor&eacute;e. Avant m&ecirc;me toute d&eacute;cision administrative d'&eacute;quipement ou de formation sp&eacute;cifiques, dans le cadre des &laquo;&nbsp;58 lyc&eacute;es&nbsp;&raquo; comme en dehors, &agrave; la seule initiative de &laquo;&nbsp;volontaires motiv&eacute;s&nbsp;&raquo;, un travail consid&eacute;rable a &eacute;t&eacute; effectu&eacute; dans les coll&egrave;ges. Le faire conna&icirc;tre c'est leur rendre justice. Les conditions diff&eacute;rentes d'enseignement, les effectifs globaux plus fournis ont conduit &agrave; un accroissement plus rapide de la demande informatique des &eacute;l&egrave;ves et des ma&icirc;tres des coll&egrave;ges . La part croissante des enseignants de ces &eacute;tablissements se traduit dans les effectifs de l'E.P.I.&nbsp;; cela n&eacute;cessitait un r&eacute;&eacute;quilibrage. Enfin, depuis sa cr&eacute;ation en 1971, l'E.P.I. agit pour la promotion et la d&eacute;mocratisation de l'enseignement public&nbsp;; c'est son orientation fondamentale&nbsp;: refusant l'informatique de l'&eacute;lite, elle demande notamment, le d&eacute;ploiement de l'informatique dans la scolarit&eacute; obligatoire qui comprend les coll&egrave;ges.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;L'essor de l'association, son souci de mieux d&eacute;finir l'informatique p&eacute;dagogique se traduisent par une abondance de r&eacute;flexions et de comptes-rendus qui ne peuvent r&eacute;guli&egrave;rement trouver place dans un bulletin trimestriel comportant d&eacute;j&agrave; plus de cent pages. La publication de brochures sp&eacute;cifiques apporte une solution heureuse comme cela s'est v&eacute;rifi&eacute; jusqu'&agrave; pr&eacute;sent, surtout dans des domaines techniques et particuli&egrave;rement pour le LSE. &Eacute;tab1i &agrave; l'initiative et sous la responsabilit&eacute; des membres de la Commission COLL&Egrave;GES, avec la participation de coll&egrave;gues ayant fourni des articles, cet ouvrage est un tr&egrave;s bon t&eacute;moignage d'un travail collectif associatif fructueux. Que tous ceux qui y ont particip&eacute; trouvent ici les remerciements chaleureux du Bureau national&nbsp;! Pour l'E.P.I. c'est le premier dossier d'un genre nouveau&nbsp;; nous souhaitons qu'il soit appr&eacute;ci&eacute; et suivi d'autres dossiers aussi riches.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Mais qu'on n'y cherche pas une pr&eacute;sentation exhaustive, une d&eacute;marche syst&eacute;matique&nbsp;; il n'y a pas de certitude p&eacute;dagogique, d'exclusivit&eacute; doctrinale. Pour l'E.P.I., l'enseignant doit rester pleinement responsable de son enseignement et cela est ins&eacute;parable de sa libert&eacute; p&eacute;dagogique. Le r&ocirc;le de l'E.P.I. c'est d'abord de susciter la curiosit&eacute; voire l'enthousiasme, d'informer, d'aider, de favoriser &eacute;changes et confrontations. Le projet est ici de contribuer &agrave; mieux situer l'informatique p&eacute;dagogique en montrant ce qu'elle peut recouvrir, ce qui peut se faire, pour provoquer des r&eacute;actions, des suites, qu'il s'agisse de critiques ou de compl&eacute;ments. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ainsi se manifeste une nouvelle fois le constant souci d'ouverture de l'E.P.I.&nbsp;: &eacute;largissement de la panoplie d'outils informatiques et de l'&eacute;ventail de r&eacute;alisations p&eacute;dagogiques pour am&eacute;liorer la qualit&eacute; de l'enseignement et contribuer &agrave; la transformation du syst&egrave;me &eacute;ducatif.</P>
<P ALIGN="RIGHT">&Eacute;milien P&eacute;lisset Michel Devaud</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
<P ALIGN="CENTER"><FONT SIZE=5><B>&Eacute;L&Eacute;MENTS POUR UN HISTORIQUE</B></FONT></P>
<P ALIGN="JUSTIFY">&nbsp;<BR>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;L'histoire de l'informatique dans l'enseignement fran&ccedil;ais n'a pas trente ans&nbsp;; elle reste &agrave; faire. Il ne s'agit ici que d'&eacute;l&eacute;ments chronologiques et de remarques &eacute;parses pour situer l'informatique p&eacute;dagogique dans les coll&egrave;ges. Cela conduit &agrave; &eacute;carter des aspects d&eacute;terminants.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Il aurait fallu par exemple &eacute;tudier l'influence de la politique &eacute;conomique sur l'&eacute;volution de l'informatique dans l'enseignement. Souvent les pr&eacute;occupations p&eacute;dagogiques n'ont gu&egrave;re pes&eacute; dans les choix gouvernementaux et le Minist&egrave;re de l'&Eacute;ducation nationale a d&ucirc; suivre le mouvement impuls&eacute; par d'autres&nbsp;:</P>

<UL>
<LI><P ALIGN="JUSTIFY"><U>essor</U> avec l'affirmation d'une informatique fran&ccedil;aise en 1966, la cr&eacute;ation de la C.I.I. en 1967, le Plan Calcul promu par la D&eacute;l&eacute;gation &agrave; l'informatique, la pr&eacute;paration du VI<SMALL><SUP>e</SUP></SMALL> Plan et &laquo;&nbsp;l'imp&eacute;ratif industriel&nbsp;&raquo;, l'&eacute;largissement europ&eacute;en du d&eacute;but des ann&eacute;es 70 (projet UNIDATA...),</P></LI>
<LI><P ALIGN="JUSTIFY"><U>coup&nbsp;d'arr&ecirc;t</U> avec &laquo;&nbsp;la crise&nbsp;&raquo;, les &eacute;conomies budg&eacute;taires, le &laquo;&nbsp;rapprochement&nbsp;&raquo; am&eacute;ricain (cr&eacute;ation de CII-HoneywellBull),</P></LI>
<LI><P ALIGN="JUSTIFY"><U>reprise</U> fin 1978 avec la micro-informatique, la t&eacute;l&eacute;matique et l'appel aux &laquo;&nbsp;utilisateurs&nbsp;&raquo; &laquo;&nbsp;Informatique et Soci&eacute;t&eacute;&nbsp;&raquo;, le &laquo;&nbsp;mariage du si&egrave;cle&nbsp;&raquo;),</P></LI>
<LI><P ALIGN="JUSTIFY"><U>acc&eacute;l&eacute;ration</U> apr&egrave;s quelques mois de &laquo;&nbsp;gel&nbsp;&raquo; dans l'&eacute;t&eacute; 1981&nbsp;: retour &agrave; l'imp&eacute;ratif industriel, affirmation d'une informatique fran&ccedil;aise, &laquo;&nbsp;g&eacute;n&eacute;ralisation&nbsp;&raquo; dans les entreprises, l'enseignement...</P></LI></UL>

<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Traiter ainsi des coll&egrave;ges c'est aussi ignorer l'&eacute;volution de l'informatique indispensable aux professionnels, informaticiens ou non. Enseignements sup&eacute;rieurs et technologiques int&egrave;grent l'informatique, ils participent aux progr&egrave;s de l'informatique comme discipline mais &eacute;galement comme outil p&eacute;dagogique, comme &eacute;l&eacute;ment d'enseignement g&eacute;n&eacute;ral. Cela n'est pas sans cons&eacute;quences sur les coll&egrave;ges d'autant que leur r&eacute;novation passe par le d&eacute;veloppement progressif de l'enseignement technologique, activit&eacute; pluridisciplinaire avec des contenus nouveaux incluant obligatoirement l'informatique, l'&eacute;lectronique, la m&eacute;canique, la gestion. <I>&laquo;&nbsp;La grande individualisation des progressions que permet notamment l'informatique, l'int&eacute;r&ecirc;t &eacute;vident des &eacute;l&egrave;ves pour cette nouvelle fa&ccedil;on d'apprendre et de travailler devraient donner lieu &agrave; des projets dans ce domaine&nbsp;&raquo;</I> (note de service du 3 janvier 1984, sur les coll&egrave;ges pour la rentr&eacute;e 1984).</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Enfin, sacrifice paradoxal, l'E.P.I., qui fut constamment m&ecirc;l&eacute;e aux &eacute;v&egrave;nements relat&eacute;s, est ici peu &eacute;voqu&eacute;e alors que ses avatars et son influence justifient sa place dans l'histoire et m&eacute;ritent une &eacute;tude particuli&egrave;re. </P>
<P><FONT SIZE=4><B>I - LES &laquo;&nbsp;58 LYC&Eacute;ES&nbsp;&raquo;... ET LES COLL&Egrave;GES</B> </FONT></P>
<P><FONT SIZE=4><B>- Origine et Originalit&eacute;</B></FONT></P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Il est commun&eacute;ment admis que l'introduction de l'informatique dans l'enseignement g&eacute;n&eacute;ral fran&ccedil;ais trouve son origine dans le s&eacute;minaire du Centre pour l'innovation et la recherche dans l'enseignement (C.E.R.I. de l'O.C.D.E. cr&eacute;&eacute; en 1968) au C.I.E.P. de S&egrave;vres en mars 1970, sur le th&egrave;me &laquo;&nbsp;l'enseignement de l'informatique &agrave; l'&eacute;cole secondaire&nbsp;&raquo;. Les recommandations du s&eacute;minaire soulignaient l'apport de l'informatique &agrave; l'enseignement g&eacute;n&eacute;ral (<I>&laquo;&nbsp;une des caract&eacute;ristiques de l'informatique est de cr&eacute;er chez les &eacute;l&egrave;ves une attitude algorithmique, op&eacute;rationnelle, organisatrice, laquelle est souhaitable pour bien des disciplines&nbsp;&raquo;</I>) et incitaient les pays membres de l'O.C.D.E. &agrave; introduire l'informatique dans l'enseignement secondaire.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;La r&eacute;ponse fran&ccedil;aise se trouve dans la circulaire minist&eacute;rielle 70.232 du 21 Mai 1970 (B.O.E.N. n&deg; 22 du 28 Mai.) qui dessine d'ambitieux objectifs&nbsp;: <I>&laquo;&nbsp;L'informatique est un ph&eacute;nom&egrave;ne qui est en train de bouleverser profond&eacute;ment les pays industrialis&eacute;s... (ses applications) en font un outil scientifique, technique et intellectuel unique.<BR>
L'enseignement secondaire tout entier et d&egrave;s la classe de 4<SMALL><SUP>&egrave;me</SUP></SMALL></I> (sic)<I> ne peut rester &agrave; l'&eacute;cart de cette r&eacute;volution. Il doit pr&eacute;parer au monde de demain dans lequel ceux qui ignoreront tout de l'informatique seront infirmes. Il doit apprendre la port&eacute;e de cet outil pour &eacute;viter les enthousiasmes excessifs et les scepticismes &eacute;troits. Il doit profiter de la valeur formatrice de l'enseignement de l'informatique, de la rigueur et de la logique qu'elle impose. Il doit faire appara&icirc;tre la port&eacute;e &eacute;conomique du ph&eacute;nom&egrave;ne et faire savoir ce que l'informatique peut apporter &agrave; la vie professionnelle. Enfin, il doit pr&eacute;parer les consciences &agrave; affronter les responsabilit&eacute;s nouvelles cr&eacute;&eacute;es par sa g&eacute;n&eacute;ralisation.&nbsp;&raquo;</I></P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Mais l'originalit&eacute; de l'exp&eacute;rience fran&ccedil;aise tient surtout &agrave; l'attitude des responsables, le Charg&eacute; de mission &agrave; l'informatique et le Comit&eacute; p&eacute;dagogique qu'il anime au Minist&egrave;re&nbsp;: les probl&egrave;mes pos&eacute;s par l'introduction de l'informatique sont p&eacute;dagogiques, leur solution est affaire d'enseignants, l'exp&eacute;rience d&eacute;butera donc par une s&eacute;rieuse formation informatique d'enseignants plong&eacute;s dans la r&eacute;alit&eacute; industrielle des constructeurs d'ordinateurs. Il sera demand&eacute; &agrave; ces cobayes d'&eacute;tudier comment utiliser cette formation et cette informatique dans leur enseignement.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Le plus souvent &agrave; l'&eacute;tranger, il en alla autrement&nbsp;; on tira de l'essor de l'informatique et des ordinateurs, la n&eacute;cessit&eacute; d'introduire, dans les &eacute;tablissements scolaires, les informaticiens, leurs machines et leurs programmes.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;C'est ainsi que, dans la r&eacute;gion parisienne, &agrave; la rentr&eacute;e de 1970-1971, s&eacute;lectionn&eacute;s parmi 1&nbsp;024 candidats (sic), 80 enseignants, venus de partout, se retrouv&egrave;rent, pour une ann&eacute;e scolaire, r&eacute;partis dans les trois centres de formation des principaux constructeurs d'ordinateurs (40 chez I.B.M., 20 &agrave; CII, 20 chez Honeywell-Bull).</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Tr&egrave;s t&ocirc;t les difficult&eacute;s de l'entreprise provoqu&egrave;rent d&eacute;sarroi, insatisfaction et protestations&nbsp;: stagiaires &eacute;loign&eacute;s de leur famille et questions mat&eacute;rielles, inadaptation et h&eacute;t&eacute;rog&eacute;n&eacute;it&eacute; des stages malgr&eacute; la bonne volont&eacute; et les efforts d'un encadrement par trop habitu&eacute; aux professionnels de l'informatique, incompatibilit&eacute; des machines et des langages d'un centre &agrave; l'autre, complexit&eacute; des probl&egrave;mes nouveaux pos&eacute;s par la mise en cause des d&eacute;marches p&eacute;dagogiques ordinaires et des contenus d'enseignements traditionnels, crainte d'une atteinte &agrave; la libert&eacute; et &agrave; la responsabilit&eacute; p&eacute;dagogiques, dangers d'ing&eacute;rence dans le service public de soci&eacute;t&eacute;s et d'int&eacute;r&ecirc;ts priv&eacute;s, incertitude de l'avenir entretenue par des r&eacute;ponses administratives jug&eacute;es trop vagues...</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;D&egrave;s leurs premi&egrave;res r&eacute;unions d'ensemble, les stagiaires ressentirent la n&eacute;cessit&eacute; d'une structure sp&eacute;cifique d'accueil, d'&eacute;change d'informations, de r&eacute;flexions et qui permette, en toute occasion, leur expression collective ind&eacute;pendante. L'association Enseignement Public et Informatique (E.P.I.) fut d&eacute;clar&eacute;e le l<SMALL><SUP>er</SUP></SMALL> F&eacute;vrier 1971 et constitu&eacute;e lors de l'assembl&eacute;e g&eacute;n&eacute;rale du 10 juin.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ce contexte a donn&eacute; &agrave; l'E.P.I. les orientations qui sont rest&eacute;es les siennes. <!A HREF="../01/b01p001.htm">L'&eacute;ditorial du bulletin n&deg;&nbsp;1</A> insistait sur la n&eacute;cessit&eacute; de l'information sur l'informatique, le refus du dogmatisme (on ne peut d&eacute;signer <I>&laquo;&nbsp;avec certitude les applications qu'il faut repousser &agrave; tout prix et celles qu'il faut encourager&nbsp;&raquo;</I>), la vocation accueillante &agrave; l'&eacute;gard des exp&eacute;riences p&eacute;dagogiques (informatique comme mati&egrave;re d'enseignement, comme m&eacute;thode de pens&eacute;e pour les disciplines existantes, comme outil p&eacute;dagogique). Il s'achevait par un appel &agrave; la vigilance&nbsp;: <I>&laquo;&nbsp;Membres de l'enseignement public, nous ne devons pas nous laisser d&eacute;poss&eacute;der de nos responsabilit&eacute;s. C'est &agrave; nous qu'il 'appartient de dire comment nous utiliserons et comment nous n'utiliserons pas l'informatique.&nbsp;&raquo;</I> L'essor de l'association montra qu'elle r&eacute;pondait &agrave; une attente des coll&egrave;gues&nbsp;: &agrave; la fin de 1971 l'effectif avait d&eacute;cupl&eacute; pour approcher sept cents adh&eacute;rents&nbsp;; une douzaine de R&eacute;gionales &eacute;taient en cours de constitution.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Alors que la circulaire du 21 mai 1970 envisageait aussi un enseignement de l'informatique par les professeurs form&eacute;s en 1970-1971 <I>&laquo;&nbsp;soit &agrave; l'occasion de leurs cours traditionnels, soit dans des cours sp&eacute;ciaux pour volontaires, organis&eacute;s &agrave; l'int&eacute;rieur de l'horaire&nbsp;&raquo;</I>, le Comit&eacute; p&eacute;dagogique donna place pr&eacute;pond&eacute;rante &agrave; l'outil p&eacute;dagogique pour les disciplines g&eacute;n&eacute;rales et &agrave; la pratique de la d&eacute;marche informatique (mod&eacute;lisante, algorithmique et organisationnelle). Si l'accord se fit tr&egrave;s t&ocirc;t entre l'administration, les syndicats et l'E.P.I. pour ne pas envisager, pour l'informatique, la cr&eacute;ation d'une discipline nouvelle d'enseignement g&eacute;n&eacute;ral et une cat&eacute;gorie particuli&egrave;re d'enseignants, l'initiation des &eacute;l&egrave;ves &agrave; l'informatique fut encourag&eacute;e par l'E.P.I. dont les adh&eacute;rents anim&egrave;rent tr&egrave;s t&ocirc;t de nombreux et actifs clubs informatiques.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Parall&egrave;lement, la D&eacute;l&eacute;gation &agrave; l'informatique avait pass&eacute; contrat avec l'&Eacute;cole Sup&eacute;rieure d'&Eacute;lectricit&eacute; pour la d&eacute;finition d'un langage adapt&eacute; aux besoins de l'enseignement secondaire. Le rapport d'octobre 1971 d&eacute;crivait le Langage Symbolique d'Enseignement (L.S.E.) extension d'un langage fran&ccedil;ais d&eacute;velopp&eacute; et utilis&eacute; &agrave; Sup-Elec depuis 1968&nbsp;: simple d'usage sans &ecirc;tre rudimentaire (proc&eacute;dures, r&eacute;cursivit&eacute;, fonction cha&icirc;nes, mode machine de bureau...), conversationnel, syst&egrave;me &laquo;&nbsp;temps partag&eacute;&nbsp;&raquo;, ensemble de modules... Ce langage est adapt&eacute; aux mini-ordinateurs alors mis au point (4 &agrave; 8 Kmots de 16 bits pour la m&eacute;moire centrale, disque auxiliaire d'au moins 100 Koctets, 8 consoles ou plus... ). Ainsi, avec L.S.E. la coh&eacute;rence de l'exp&eacute;rience devenait possible&nbsp;: &eacute;changes et coordination pour la formation, la recherche, l'exp&eacute;rimentation... et &agrave; tous les niveaux. Ce n'&eacute;tait pas rien pour des coll&egrave;gues qui avaient pratiqu&eacute; des langages assembleurs de machines incompatibles et des langages &eacute;volu&eacute;s divers (surtout FORTRAN, COBOL et PL/1). Seuls les stagiaires d'Honeywell-Bull avaient rencontr&eacute; BASIC une semaine&nbsp;; nombreux sont les coll&egrave;gues qui durent attendre les conf&eacute;rences du C.N.A.M. et le 3<SMALL><SUP>&egrave;me</SUP></SMALL> trimestre de 1972 pour le d&eacute;couvrir.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dans toute cette affaire &laquo;&nbsp;secondaire&nbsp;&raquo; doit &ecirc;tre entendu comme aujourd'hui on entend &laquo;&nbsp;de second degr&eacute;&nbsp;&raquo;, incluant tous les lyc&eacute;es mais aussi tous les coll&egrave;ges (les premiers cycles de lyc&eacute;es, les coll&egrave;ges d'enseignement g&eacute;n&eacute;ral, les coll&egrave;ges d'enseignement technique d'alors). L'appellation trompeuse &laquo;&nbsp;d'exp&eacute;rience des 58 lyc&eacute;es&nbsp;&raquo; fut donn&eacute;e apr&egrave;s que coll&egrave;ges et lyc&eacute;es aient &eacute;t&eacute; s&eacute;par&eacute;s (loi de 1975 sur les C.E.S.). Parmi les stagiaires de 1970-1971 on comptait 20 P.E.G.C., treize enseignants du &laquo;&nbsp;technique&nbsp;&raquo; de cat&eacute;gories diverses, 47 titulaires de CAPES ou agr&eacute;gations qui pouvaient enseigner indiff&eacute;remment dans l'un ou l'autre cycle. Les th&egrave;mes d'&eacute;tudes retenus pour ses travaux de 1971-1972 par la R&eacute;gionale E.P.I. de Paris sont&nbsp;: l'appartenance en 6<SMALL><SUP>&egrave;me</SUP></SMALL>, la notion de temps en 3<SMALL><SUP>&egrave;me</SUP></SMALL>, l'expression de la cause en 4<SMALL><SUP>&egrave;me</SUP></SMALL> et la notion de mod&egrave;le en Terminale. Le niveau &laquo;&nbsp;coll&egrave;ge&nbsp;&raquo; est donc privil&eacute;gi&eacute; et cela a &eacute;t&eacute; tr&egrave;s souvent le cas, les &eacute;l&egrave;ves du premier cycle &eacute;tant, peut-&ecirc;tre, plus &laquo;&nbsp;mall&eacute;ables et disponibles&nbsp;&raquo; que ceux du second, vite obnubil&eacute;s par l'&eacute;ch&eacute;ance de l'examen.</P>
<P><FONT SIZE=4><B>- Formations</B></FONT></P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Les le&ccedil;ons du premier stage tir&eacute;es, la formation approfondie &laquo;&nbsp;lourde&nbsp;&raquo; se d&eacute;roulera, &agrave; partir de 1971-1972, en milieu universitaire dans quatre centres&nbsp;: I.U.T. de Nancy, de Toulouse I.M.A.G.de Grenoble et E.N.S. de St Cloud (ici &agrave; mi-temps). Comme l'avait souhait&eacute; l'E.P.I., l'encadrement fut &laquo;&nbsp;panach&eacute;&nbsp;&raquo; (enseignants du sup&eacute;rieur et enseignants du secondaire, du terrain), le recrutement des stagiaires (9,8) resta pluricat&eacute;goriel et pluridisciplinaire. L'ouverture du centre de Rennes en 1973 n'augmenta pas l'effectif annuel qui passa de 90 &agrave; 80.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ainsi de 1970 &agrave; 1976, 528 coll&egrave;gues furent form&eacute;s (140 &laquo;&nbsp;math&eacute;maticiens&nbsp;&raquo;, environ 200 &laquo;&nbsp;litt&eacute;raires&nbsp;&raquo;, plus de quarante &laquo;&nbsp;&eacute;conomistes&nbsp;&raquo;...). Le souci de former des &eacute;quipes en rapport avec les &eacute;tablissements &eacute;quip&eacute;s pr&eacute;valut sur celui d'une r&eacute;partition g&eacute;ographiquement satisfaisante, cela n'alla pas sans probl&egrave;me, compte tenu du grand nombre de candidatures.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dans le m&ecirc;me temps, le C.N.T.E. de Vanves diffusa un cours par correspondance r&eacute;dig&eacute; par un groupe d'enseignants et compl&eacute;t&eacute; par deux fois deux jours d'applications sur ordinateur. Cette formation dite &laquo;&nbsp;l&eacute;g&egrave;re&nbsp;&raquo; concerna plus de 5&nbsp;000 coll&egrave;gues. Enfin, nombreux furent ceux qui se form&egrave;rent &laquo;&nbsp;sur le tas&nbsp;&raquo; et/ou en dehors de l'exp&eacute;rience.</P>
<P><FONT SIZE=4><B>- Coordination, recherche et exp&eacute;rimentation p&eacute;dagogiques</B></FONT></P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;D&egrave;s la rentr&eacute;e de 1971, &eacute;tait cr&eacute;&eacute;e &agrave; l'I.N.R.D.P., la Section Informatique et Enseignement (S.I.E.) comprenant, au d&eacute;part, trois personnes dont deux des premiers stagiaires. Son r&ocirc;le fut de r&eacute;unir et de distribuer les informations, d'animer et de coordonner les recherches p&eacute;dagogiques, d'en valider et diffuser les r&eacute;sultats. Avec des moyens toujours tr&egrave;s limit&eacute;s, la S.I.E. a su, par un travail soutenu, consid&eacute;rable, &eacute;viter la gadg&eacute;tisation informatique, assurer la qualit&eacute; p&eacute;dagogique comme la coh&eacute;rence du dispositif, aider et stimuler efficacement les coll&egrave;gues impliqu&eacute;s. Ceux-ci se r&eacute;partirent en groupes et sous-groupes de recherches disciplinaires et interdisciplinaires comme le groupe &laquo;&nbsp;Informatique et Sciences humaines&nbsp;&raquo; qui tint deux r&eacute;unions mensuelles d&egrave;s le premier trimestre 1971.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;En 1972, d&eacute;butait la publication du bulletin de liaison (15 Num&eacute;ros, des num&eacute;ros sp&eacute;ciaux, celui d'avril 1973 &eacute;tant le premier manuel du L.S.E. r&eacute;&eacute;dit&eacute; et compl&eacute;t&eacute; en janvier 1975). Au total plus de 2&nbsp;500 pages diffus&eacute;es sans compter les feuilles d'information adress&eacute;es par ailleurs.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Fin 1973, &eacute;taient diffus&eacute;s les premiers logiciels produits sous forme de fiches p&eacute;dagogiques et de rubans perfor&eacute;s pour le chargement en machine (plus de 5&nbsp;000 furent ainsi dupliqu&eacute;s et exp&eacute;di&eacute;s). La banque, peu &agrave; peu enrichie, compta finalement quatre cents logiciels p&eacute;dagogiques. Comme le montre le catalogue de l'I.N.R.P. (juin 80) l'enseignement du premier cycle &eacute;tait largement concern&eacute; (par 1/3 des logiciels de math&eacute;matiques et d'histoire-g&eacute;ographie, par 90 % des logiciels de lettres, par tous les logiciels de langues...)</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&Agrave; partir de 1974, la S.I.E. comprenait un groupe d'&eacute;valuation de six personnes qui &eacute;tudiaient le fonctionnement des &eacute;tablissements &eacute;quip&eacute;s et les cons&eacute;quences p&eacute;dagogiques de l'introduction de l'informatique (observations directes, exp&eacute;rimentations, enqu&ecirc;tes... ).</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Enfin, la participation aux rencontres internationales (I.F.I.P., O.C.D.E.) et surtout l'organisation de s&eacute;minaires nationaux chaque ann&eacute;e, donn&egrave;rent &agrave; l'exp&eacute;rience son dynamisme et son rayonnement.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Comme les bulletins de liaison, les bulletins de l'E.P.I. t&eacute;moignent de la richesse des activit&eacute;s et de la diversit&eacute; des sujets abord&eacute;s (langage d'auteur pour le n&deg;&nbsp;5 en 1973, docimologie dans le n&deg;&nbsp;6, activit&eacute; mod&eacute;lisante et langage dans le n&deg;&nbsp;7 en 1974, lexicologie dans le n&deg;&nbsp;10 en 1975...). Les actions pour obtenir les moyens n&eacute;cessaires n'&eacute;taient pas oubli&eacute;es&nbsp;: que d'&eacute;vocations des heures effectives de d&eacute;charge de service&nbsp;! </P>
<P><FONT SIZE=4><B>&Eacute;quipements</B></FONT></P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Outre ces moyens, les &laquo;&nbsp;form&eacute;s&nbsp;&raquo; et l'E.P.I. r&eacute;clam&egrave;rent &eacute;galement d&egrave;s 1971, les ordinateurs sans lesquels la d&eacute;marche informatique risquait d'&ecirc;tre ramen&eacute;e &agrave; une forme nouvelle d'abstraction. La demande d'initiation informatique des ma&icirc;tres comme des &eacute;l&egrave;ves &laquo;&nbsp;contamin&eacute;s&nbsp;&raquo; par les stagiaires rentr&eacute;s dans leurs &eacute;tablissements, allait dans le m&ecirc;me sens.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;La rencontre fran&ccedil;aise de deux mini-ordinateurs (Mitra 15 de la CII et T1600 de la T&eacute;l&eacute;m&eacute;canique &Eacute;lectrique) et du syst&egrave;me L.S.E. assura une compatibilit&eacute; et une portabilit&eacute; bien sup&eacute;rieures &agrave; ce qu'aurait permis alors toute autre combinaison. Le &laquo;&nbsp;temps partag&eacute;&nbsp;&raquo; fut utilis&eacute; pour entourer chaque machine de 8 consoles (16 postes de travail avec deux &eacute;l&egrave;ves par console) avec une t&eacute;l&eacute;type ayant un lecteur/perforateur de ruban. Le co&ucirc;t &eacute;lev&eacute; donc les faibles dimensions de la m&eacute;moire centrale exigeaient une m&eacute;moire auxiliaire, disque de 128 Koctets jug&eacute; au d&eacute;part plus que suffisant et qui s'av&eacute;ra, tr&egrave;s vite et partout, bien exigu, ce qui imposa l&eacute; doublement de sa capacit&eacute;.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Les quatre premiers lyc&eacute;es furent &eacute;quip&eacute;s, &agrave; proximit&eacute; des quatre premiers centres de formation &laquo;&nbsp;lourde&nbsp;&raquo;, en 1973-1974&nbsp;; 11 autres en 1973-1974, 23 en 1974-1975 et 20 en 1975-1976 Alors l'exp&eacute;rience devint celle des &laquo;&nbsp;58 lyc&eacute;es&nbsp;&raquo;, mais 60<FONT SIZE=1>&nbsp;</FONT>% d'entre eux partagent leurs locaux avec un coll&egrave;ge et plus de 20<FONT SIZE=1>&nbsp;</FONT>% re&ccedil;oivent r&eacute;guli&egrave;rement des &eacute;l&egrave;ves de l'ext&eacute;rieur (enqu&ecirc;te d'avril 1977 et suppl&eacute;ment au bulletin de liaison n&deg; 14).</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Quels furent les crit&egrave;res de choix des implantations&nbsp;? Sans doute l'existence d'une &eacute;quipe d'enseignants form&eacute;s, ayant des projets p&eacute;dagogiques, fut-elle d&eacute;terminante. Ainsi les moyens attribu&eacute;s &agrave; ces personnels (d&eacute;charges de service) ne n&eacute;cessitaient pas une r&eacute;partition rigide entre travaux dans les groupes de recherches p&eacute;dagogiques et activit&eacute;s dans les &eacute;tablissements &eacute;quip&eacute;s. L'exp&eacute;rience y gagna encore en coh&eacute;rence. Soucieuse de la totale ma&icirc;trise de l'outil par les enseignants, l'E.P.I. pr&eacute;f&eacute;ra la gestion des salles d'informatique par les ma&icirc;tres eux-m&ecirc;mes plut&ocirc;t que le recours &agrave; des techniciens informatiques. Le manque d'int&eacute;r&ecirc;t des constructeurs pour le L.S.E. amena d'ailleurs tr&egrave;s vite les enseignants &agrave; prendre en charge l'&eacute;volution du langage. Cela eut peut-&ecirc;tre l'avantage de &laquo;&nbsp;prot&eacute;ger&nbsp;&raquo; le service public de beaucoup d'influences d&eacute;l&eacute;t&egrave;res.</P>
<P><FONT SIZE=4><B>II - LE COUP D'ARR&Ecirc;T DE 1976</B></FONT></P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;En septembre 1975, le Secr&eacute;taire d'&Eacute;tat aux Universit&eacute;s supprime la Mission &agrave; l'informatique.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Les difficult&eacute;s &eacute;conomiques entra&icirc;nent un plan d'aust&eacute;rit&eacute; et un budget de rigueur pour l'&Eacute;ducation nationale en 1976. La Direction g&eacute;n&eacute;rale de la programmation et de la coordination (D.G.P.C.), qui a confi&eacute; la gestion de l'exp&eacute;rience &agrave; la Direction des lyc&eacute;es, supprime les formations et d&eacute;cide de l'arr&ecirc;t des &eacute;quipements (janvier-f&eacute;vrier 1976).</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;L'E.P.I., les stagiaires en formation protestent et font des contre-propositions visant &agrave; am&eacute;liorer les conditions de l'exp&eacute;rience. Pour le minist&egrave;re, le d&eacute;veloppement d'une exp&eacute;rience d'une telle envergure ne peut se concevoir que dans la perspective de la g&eacute;n&eacute;ralisation de l'introduction de l'informatique&nbsp;; l'&eacute;volution rapide des mat&eacute;riels et des co&ucirc;ts doit conduire &agrave; une autre politique d'&eacute;quipement&nbsp;; aussi attendra-t-on quatre ans pour se prononcer, apr&egrave;s les r&eacute;sultats d'une &eacute;valuation par le groupe de l'I.N.R.P., assist&eacute; d'une commission minist&eacute;rielle d'orientation...</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Toutefois, le volume des d&eacute;charges de service et une partie des postes attribu&eacute;s ant&eacute;rieurement sont conserv&eacute;s&nbsp;; quelques am&eacute;liorations techniques facilitent l'usage des mat&eacute;riels en place (notamment les lecteurs/enregistreurs de disquettes 8 pouces). Une nouvelle s&eacute;rie de cours du C.N.T.E. assortie d'un stage de trois jours est diffus&eacute;e entre 1976 et 1979&nbsp;; elle est payante. Elle touchera un millier de coll&egrave;gues. Mais il n'y aura aucune formation approfondie de 1976 &agrave; 1981.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Fin 1976, dans le bulletin n&deg; 14, l'E.P.I. publie ses propositions &laquo;&nbsp;pour une g&eacute;n&eacute;ralisation de l'introduction de l'informatique dans l'enseignement&nbsp;&raquo;. Quatre pages sont consacr&eacute;es aux objectifs, aux moyens (en personnel, en mat&eacute;riel, en logiciel), &agrave; la formation des enseignants et &agrave; la recherche p&eacute;dagogique.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&laquo;&nbsp;Mise en orbite d'attente&nbsp;&raquo; l'exp&eacute;rience se contracte, perd de sa substance, r&eacute;duit ses ambitions. L'&eacute;quipe de l'I.N.R.P. poursuit sur sa lanc&eacute;e avec des moyens de plus en plus limit&eacute;s. Elle s'efforce d'organiser encore des colloques (deux &agrave; Toulouse)&nbsp;; la derni&egrave;re &laquo;&nbsp;r&eacute;union de travail&nbsp;&raquo; au C.I.EP. de S&egrave;vres les 25 et 26 Mai 1978 fournit la substance du dernier bulletin de liaison en d&eacute;cembre 1978. Le rattachement de la recherche en informatique p&eacute;dagogique &agrave; un d&eacute;partement de l'I.N.R.P. nouveau n'apporte gu&egrave;re d'espoirs de d&eacute;veloppement.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Pour l'E.P.I. commence &laquo;&nbsp;la travers&eacute;e du d&eacute;sert&nbsp;&raquo;. Elle perd les trois quarts de ses adh&eacute;rents et s'&eacute;puise en interventions pour d&eacute;fendre les d&eacute;charges de service effectives et lutter contre l'arbitraire pr&eacute;ludant &agrave; leur attribution. Les bulletins sont de plus en plus espac&eacute;s.</P>
<P><FONT SIZE=4><B>III - LES &laquo;&nbsp;10&nbsp;000 MICRO-ORDINATEURS&nbsp;&raquo;</B> </FONT></P>
<P ALIGN="JUSTIFY">- <I>&laquo;&nbsp;L'informatisation de la soci&eacute;t&eacute;&nbsp;&raquo;</I>, rapport de Simon NORA et Alain MINC est remis en janvier 1978 au Pr&eacute;sident de la R&eacute;publique qui, en novembre, demande au gouvernement d'&eacute;laborer un nouveau plan informatique pour accro&icirc;tre l'efficacit&eacute;, la comp&eacute;titivit&eacute; du syst&egrave;me &eacute;conomique. L'av&egrave;nement des micro-ordinateurs et la t&eacute;l&eacute;matique permettent une consommation informatique de masse&nbsp;; il faut d&eacute;velopper la demande des utilisateurs.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;En f&eacute;vrier 1979, le Minist&egrave;re de l'industrie et la Mission &agrave; l'Informatique proposent au Minist&egrave;re de l'&Eacute;ducation nationale le financement d&egrave;s 1979, du d&eacute;but d'un plan tendant &agrave; la g&eacute;n&eacute;ralisation des &eacute;quipements des lyc&eacute;es en micro-ordinateurs.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Le bulletin n&deg; 18 publie <!A HREF="../18/b18p055.htm">le Manifeste de l'E.P.I.</A> pour &eacute;tendre et diversifier l'introduction de l'informatique dans l'enseignement&nbsp;: <I>&laquo;&nbsp;Nul ne peut ignorer l'informatique dans le monde moderne. Elle nous concerne tous comme travailleurs, comme consommateurs, comme citoyens et elle nous concerne d'autant plus qu'elle a des implications, non seulement dans le domaine mat&eacute;riel, mais aussi dans celui de la pens&eacute;e et de la communication, En tant qu'outil p&eacute;dagogique, elle peut s'appliquer &agrave; tous les niveaux d'enseignement. Mais elle ne doit pas se limiter &agrave; cela. Elle doit aussi devenir un &eacute;l&eacute;ment de culture g&eacute;n&eacute;rale dont tous les &eacute;l&egrave;ves puissent b&eacute;n&eacute;ficier.&nbsp;&raquo;</I> L'informatique doit &ecirc;tre un moyen de d&eacute;mocratisation mis en oeuvre dans la scolarit&eacute; obligatoire, les espaces scolaires d&eacute;favoris&eacute;s. Le d&eacute;veloppement ne peut ignorer les acquis de l'exp&eacute;rience ant&eacute;rieure&nbsp;; la diversification des mat&eacute;riels et des langages ne saurait faire abandonner la compatibilit&eacute; et la portabilit&eacute; (<I>&laquo;&nbsp;sauvegarder le travail r&eacute;alis&eacute; (400 logiciels), pr&eacute;server la compatibilit&eacute; en d&eacute;finissant sur les divers supports une structure unique de fichiers et en conservant le langage L.S.E...&nbsp;&raquo;</I>)&nbsp;; il faut <I>&laquo;&nbsp;prendre comme crit&egrave;re essentiel les objectifs p&eacute;dagogiques des enseignants&nbsp;&raquo;</I>, relancer les formations en donnant priorit&eacute; &agrave; la formation approfondie d'un an, d&eacute;velopper la recherche en &eacute;quipes pluridisciplinaires dans un centre national et des centres acad&eacute;miques, attribuer au moins l'&eacute;quivalent d'un demi-poste pour l'animation des &eacute;tablissements &eacute;quip&eacute;s....</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Se fondant sur ce manifeste, le Bureau de l'E.P.I. multiplie les interventions aupr&egrave;s des autorit&eacute;s administratives (y compris &agrave; la Direction des Coll&egrave;ges, &agrave; la Direction des &Eacute;coles) et alerte les syndicats et les associations concern&eacute;es.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;La D.G.P.C. cr&eacute;e un groupe de travail minist&eacute;riel et confie la ma&icirc;trise d'oeuvre &agrave; la Direction des Lyc&eacute;es. Dans une perspective de g&eacute;n&eacute;ralisation pour les lyc&eacute;es, les objectifs principaux sont l'utilisation du micro-ordinateur comme outil p&eacute;dagogique dans les disciplines pour am&eacute;liorer l'enseignement et la familiarisation des &eacute;l&egrave;ves avec l'informatique pour la d&eacute;mythifier et leur faire mieux comprendre le monde o&ugrave; ils vivent.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Du 24 au 28 septembre 1979, le colloque &laquo;&nbsp;Informatique et Soci&eacute;t&eacute;&nbsp;&raquo; consacra cette nouvelle politique. 1980 appara&icirc;t l'ann&eacute;e charni&egrave;re&nbsp;: les m&eacute;dias mettent l'informatique au go&ucirc;t du jour. Les &eacute;tudes foisonnent (Mission T&eacute;b&eacute;ka, Mission Simon <I>&Eacute;ducation et informatisation de la soci&eacute;t&eacute;</I>... ). L'Agence de l'Informatique r&eacute;cemment cr&eacute;&eacute;e aide au d&eacute;veloppement. Les organisations, particuli&egrave;rement les syndicats, prennent conscience de l'importance de l'enjeu... Gr&acirc;ce aux initiatives des enseignants, le L.S.E. est adapt&eacute; aux micro-ordinateurs, l'E.P.I. r&eacute;alise la version correspondante du manuel, <I>L.S.E. pour tous</I>, elle reprend son essor.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Le 25 novembre 1980, lors du mariage du si&egrave;cle &laquo;&nbsp;&Eacute;ducation et Informatique&nbsp;&raquo;, le Ministre de l'&Eacute;ducation nationale pr&eacute;sente son plan&nbsp;: tous les lyc&eacute;es &eacute;quip&eacute;s d'ici 1986, une option informatique est cr&eacute;&eacute;e&nbsp;; pour les coll&egrave;ges, seulement une exp&eacute;rience&nbsp;; pour les &eacute;coles, jeux et calculettes.</P>
<P><FONT SIZE=4><B>- les &eacute;quipements</B></FONT></P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;La proc&eacute;dure suivie est celle des march&eacute;s publics. Les cahiers des charges concernent des micro-ordinateurs autonomes avec leur BASIC et L.S.E. (la normalisation en est demand&eacute;e par l'&Eacute;ducation nationale &agrave; l'A.F.N.O.R.)</P>
<P ALIGN="JUSTIFY"><B>&middot;</B>&nbsp;l<SMALL><SUP>re</SUP></SMALL> tranche (1979-1980)&nbsp;: 416 machines (LX 500 de Logabax, Xl de la St&eacute; Occitane d'&eacute;lectronique) dans 170 &eacute;tablissements (une, deux, quatre ou huit machines par lyc&eacute;e). Un souci de meilleure r&eacute;partition g&eacute;ographique mais trop de &laquo;&nbsp;saupoudrage&nbsp;&raquo;, une &eacute;quivoque introduite par l'adjonction tardive d'une exp&eacute;rience d'informatique documentaire aux C.D.I. et des difficult&eacute;s dues aux constructeurs (faillite de la Soci&eacute;t&eacute; Occitane ...)</P>
<P ALIGN="JUSTIFY"><B>&middot;</B>&nbsp;2<SMALL><SUP>&egrave;me</SUP></SMALL> tranche (1980-1981)&nbsp;: 800 machines (LX de Logabax et Micral 8022 de R2E)&nbsp;; 8 machines et une imprimante par lyc&eacute;e.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;La direction des Lyc&eacute;es demande qu'une partie de la biblioth&egrave;que de logiciels soit transcrite pour les micro-ordinateurs&nbsp;; &agrave; cet effet un groupe est mis en place au lyc&eacute;e de S&egrave;vres et la diffusion par le C.N.D.P. est envisag&eacute;e. </P>
<P><FONT SIZE=4><B>- les formations</B></FONT></P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Il est d&eacute;cid&eacute; d'accompagner l'&eacute;quipement des &eacute;tablissements par une &laquo;&nbsp;formation l&eacute;g&egrave;re&nbsp;&raquo; donn&eacute;e sur place pour les volontaires. L'E.P.I. obtient son &eacute;tirement &agrave; deux semaines (le plus souvent 4 s&eacute;quences de 3 jours) mais doit attendre 1981 pour que les formations approfondies soient relanc&eacute;es. En effet &agrave; la rentr&eacute;e de 1979-1980, une trentaine d'anciens stagiaires, pr&eacute;lev&eacute;s dans le vivier des &laquo;&nbsp;58 lyc&eacute;es&nbsp;&raquo;, suivent un stage de perfectionnement de trois semaines &agrave; S&egrave;vres pour devenir des formateurs pour la nouvelle formation l&eacute;g&egrave;re. En deux ans elle concerne plus de 4&nbsp;000 coll&egrave;gues.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dans le second trimestre de 1980-1981, et pour moins d'une centaine d'enseignants, les centres de l'ENS de St Cloud des I.U.T. de Nancy et de Toulouse rouvrent enfin.</P>
<P><FONT SIZE=4><B>- le programme exp&eacute;rimental des coll&egrave;ges</B></FONT></P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dans le programme d'action du Minist&egrave;re (mars 1981) les objectifs en sont nombreux&nbsp;: familiariser avec l'informatique, outil pour l'acquisition des&#9;savoirs, aide aux &eacute;l&egrave;ves, en difficult&eacute;, individualisation, soutien, sensibilisation dans l'option technologique en 4&egrave;me. L'&eacute;quipement d'une centaine de coll&egrave;ges est envisag&eacute;&nbsp;; neuf coll&egrave;ges auront un terminal dans l'exp&eacute;rience t&eacute;l&eacute;matique de V&eacute;lisy. Pour la formation, on compte sur les Centres de formation des P.E.G.C. mais l'appel sera fait &eacute;galement aux centres universitaires de formation approfondie. Au niveau acad&eacute;mique, la sensibilisation des enseignants des coll&egrave;ges est entreprise &agrave; l'initiative des responsables informatiques mais l'afflux des candidats en limite la port&eacute;e (les 36 heures pr&eacute;vues &agrave; Versailles sont ramen&eacute;es &agrave; une dizaine car il y a six cents candidats) .</P>
<P><FONT SIZE=4><B>IV - L'ACC&Eacute;L&Eacute;RATION</B> </FONT></P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;D&egrave;s le 20 mai 1981, l'E.P.I. demande audience au nouveau Ministre de l'&eacute;ducation Nationale et, &agrave; l'annonce du &laquo;&nbsp;gel&nbsp;&raquo; du plan informatique, multiplie les interventions &agrave; tous les niveaux administratifs (particuli&egrave;rement au Cabinet du Ministre), sollicite l'appui des syndicats, des associations de sp&eacute;cialistes... La r&eacute;action du Minist&egrave;re est rapide&nbsp;: le 3 Juillet, une mission est confi&eacute;e &agrave; Claude PAIR et Yves LE CORRE&nbsp;; le 23 Juillet une note annonce, pour la rentr&eacute;e, l'accroissement des formations et des &eacute;quipements, la mise en place de l'option en Seconde. Une phase de concertation et de travail sans pr&eacute;c&eacute;dent s'ouvre. Le rapport sur &laquo;&nbsp;L'Introduction de l'informatique dans l'&Eacute;ducation nationale&nbsp;&raquo;, remis le 15 octobre, reprend l'essentiel des pr&eacute;occupations exprim&eacute;es par l'E.P.I. (cf. bulletin n&deg; 25, pages 28 &agrave; 36) mais, dans la pratique, il limite l'effort pour les coll&egrave;ges &agrave; l'exp&eacute;rimentation souhait&eacute;e par la Direction des Coll&egrave;ges alors que l'effort pour les lyc&eacute;es est tr&egrave;s sensiblement accru. Il s'acc&eacute;l&egrave;rera avec l'exp&eacute;rimentation en Lyc&eacute;es d'enseignement professionnel puis l'&eacute;quipement de nombre de ces &eacute;tablissements (fin 1982, environ la moiti&eacute; des sept cents lyc&eacute;es &eacute;quip&eacute;s sont des L.E.P.).</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;On peut d&egrave;s lors s&eacute;parer plus facilement l'histoire informatique des coll&egrave;ges de celle des lyc&eacute;es encore que les services intervenant dans les deux soient toujours nombreux D.G.P.C. (Prospective et d&eacute;veloppement des moyens techniques et scientifiques dans l'&eacute;ducation) puis M.I.T.I.F. (Mission des Techniques nouvelles de l'innovation p&eacute;dagogique et de la formation) et enfin Mission de la formation et de la recherche p&eacute;dagogique avec les Missions acad&eacute;miques correspondantes&nbsp;; Mission informatique du C.N.D.P. avec C.R.D.P. et C.D.D.P., I.N.R.P. et recherches p&eacute;dagogiques. Souvent dans les rectorats, les m&ecirc;mes responsables informatiques sont charg&eacute;s des Coll&egrave;ges et des Lyc&eacute;es. Les Centres universitaires de formation approfondie accueillent toujours des stagiaires venant des Coll&egrave;ges et des Lyc&eacute;es. Si l'interfa&ccedil;age Lyc&eacute;es-Coll&egrave;ges est tr&egrave;s riche, il n'est pas toujours satisfaisant et la d&eacute;centralisation est souvent source de complications. L'E.P.I. demande une plus grande coh&eacute;rence des actions en informatique p&eacute;dagogique, des perspectives nettes et un pilotage national suffisant.</P>
<P><FONT SIZE=4><B>- En 1981-1982</B></FONT></P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Les 48 premiers coll&egrave;ges exp&eacute;rimentaux sont choisis, leur &eacute;quipement commence en 82 (6 Micral 80-22 G avec carte graphique et une imprimante Lina 11). Chaque &eacute;tablissement dispose de l'&eacute;quivalent d'un poste d'adjoint d'enseignement (18 heures) pour la gestion de la salle d'informatique, l'animation de l'&eacute;quipe informatique, la mise en oeuvre et la production de logiciels, les relations ext&eacute;rieures&nbsp;; mais ces moyens ne sont pas utilisables pour la formation des coll&egrave;gues de l'&eacute;tablissement ou l'animation du club informatique (note du 9 juin 1983).</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;La Commission COLL&Egrave;GES, dans le bulletin n&deg; 25, prend position et publie une adaptation aux coll&egrave;ges de la charte de l'E.P.I. (6 Machines sont insuffisantes, il en faudrait 8 voire 12&nbsp;; La priorit&eacute; doit aller &agrave; la formation pluridisciplinaire, pluricat&eacute;gorielle avec des formations approfondies nombreuses pour constituer un vivier de formateurs&nbsp;; la transparence dans les proc&eacute;dures de choix des stagiaires est r&eacute;clam&eacute;e comme des heures d'animation dans tous les coll&egrave;ges pratiquant l'informatique m&ecirc;me s'ils ne sont pas &laquo;&nbsp;exp&eacute;rimentaux&nbsp;&raquo;...)</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Au centre de formation des P.E.G.C. d'Auteuil, quatre stages de cinq semaines forment, par groupes de douze, les 48 responsables informatiques des coll&egrave;ges &eacute;quip&eacute;s.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;En formation approfondie (11 centres universitaires et pr&egrave;s de 250 stagiaires au total) on retrouve, pour un trimestre, les 9 directeurs d'&eacute;tudes en stage depuis f&eacute;vrier 1981 et, pour l'ann&eacute;e, quatre autres directeurs d'&eacute;tudes, destin&eacute;s, comme les pr&eacute;c&eacute;dents, &agrave; &ecirc;tre formateurs, et 13 enseignants de coll&egrave;ges form&eacute;s &agrave; l'&eacute;poque pour devenir de futurs auteurs de logiciels.</P>
<P><FONT SIZE=4><B>- En 1982-1983</B></FONT></P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&Agrave; la rentr&eacute;e est constitu&eacute;e avec quatre coll&egrave;gues, en demi-service, aupr&egrave;s du charg&eacute; de mission &agrave; la Direction des Coll&egrave;ges, une cellule informatique. Elle a pour r&ocirc;le le pilotage de l'exp&eacute;rience, l'&eacute;change d'informations et des produits&nbsp;; elle diffuse un bulletin &laquo;&nbsp;Antenne 84&nbsp;&raquo;.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;La deuxi&egrave;me tranche d'&eacute;quipement concerne 36 coll&egrave;ges. L'E.P.I. rappelle ses pr&eacute;occupations&nbsp;: la configuration &agrave; 6 micro-ordinateurs est insuffisante, le &laquo;&nbsp;saupoudrage&nbsp;&raquo; envisag&eacute; hors exp&eacute;rimentation n'est pas efficace, la priorit&eacute; de la formation doit se traduire par l'accroissement sensible de l'effectif des stagiaires en formation approfondie.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Au Centre d'Auteuil, les 36 responsables informatiques nouveaux re&ccedil;oivent une formation d'un trimestre. Mais 46 stagiaires sont en formation lourde (sur les 380 r&eacute;partis entre 15 centres) et les Missions acad&eacute;miques int&egrave;grent dans leur plan des formations pour les personnels des coll&egrave;ges.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Annonc&eacute; le 2 f&eacute;vrier 1983 par le Pr&eacute;sident de la R&eacute;publique, le plan d'&eacute;quipement en micro-ordinateurs &laquo;&nbsp;grand public&nbsp;&raquo; de seize d&eacute;partements (6&nbsp;000 TO7 livr&eacute;s en 1983 et 1984) int&eacute;resse les coll&egrave;ges au m&ecirc;me titre que les &eacute;coles et les L.E.P. mais il complique singuli&egrave;rement le dispositif d'ensemble. Le financement est partag&eacute; entre l'&Eacute;ducation nationale et les Conseils G&eacute;n&eacute;raux qui interviennent donc dans la mise en oeuvre. L'administration des coll&egrave;ges et celle des lyc&eacute;es font, &agrave; la diff&eacute;rence de celle des &eacute;coles, peu de place &agrave; l'&eacute;chelon d&eacute;partemental. La direction des &eacute;coles peut donc se manifester plus efficacement que les autres directions p&eacute;dagogiques. Elle trouve dans &laquo;&nbsp;l'op&eacute;ration TO7&nbsp;&raquo; l'occasion d'organiser des r&eacute;unions nationales o&ugrave; les deux autres directions &laquo;&nbsp;font figure de parents pauvres&nbsp;&raquo;.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;La diversit&eacute; dans les conditions de r&eacute;partition des machines et de formation des ma&icirc;tres est tr&egrave;s grande&nbsp;; dans chaque d&eacute;partement, le chef de projet' est soit l'Inspecteur d'Acad&eacute;mie, soit le Directeur d'&Eacute;cole Normale, soit le Directeur du C.D.D.P. Les personnels des coll&egrave;ges sont peu repr&eacute;sent&eacute;s parmi les animateurs, les formateurs&nbsp;; les formations qui leur sont propos&eacute;es sont souvent insuffisantes et se font essentiellement en dehors de leur service. Enfin les TO7 livr&eacute;s ne permettent pas d'utiliser le langage L.S.E. et les logiciels du C.N.D.P. Les efforts actuellement r&eacute;alis&eacute;s, notamment par l'E.P.I., pour l'implantation du L.S.E. et de logo devraient aboutir en 1984.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dans ces conditions, les instructions nationales donn&eacute;es par la Direction des Coll&egrave;ges ne peuvent &ecirc;tre pr&eacute;cises et la coordination avec l'exp&eacute;rience des 84 coll&egrave;ges est tr&egrave;s difficile. La r&eacute;alisation de r&eacute;seaux locaux associant les deux types de micro-ordinateurs est une des solutions avanc&eacute;es par l'E.P.I.</P>
<P><FONT SIZE=4><B>- En 1983-1984</B></FONT></P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;En attribuant aux formations l'&eacute;quivalent de plusieurs centaines de postes, la Direction des Coll&egrave;ges fait un effort sans pr&eacute;c&eacute;dent&nbsp;: 180 stagiaires en formation approfondie (sur un total de 500 r&eacute;partis en 20 centres) et une place appr&eacute;ciable faite aux personnels des coll&egrave;ges dans les plans acad&eacute;miques de formation. &Agrave; Auteuil, six stages d'un demi-trimestre apportent un enseignant form&eacute; de plus &agrave; chacun des coll&egrave;ges exp&eacute;rimentaux.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;De m&ecirc;me, &agrave; la suite de l'appel d'offres du C.N.D.P. (Unit&eacute; Logiciel) pour la production des logiciels, 166 dossiers concernant les coll&egrave;ges (sur plus de 800) ont &eacute;t&eacute; &eacute;tudi&eacute;s&nbsp;; 35 projets ont &eacute;t&eacute; retenus et sont suivis par la Direction des Coll&egrave;ges (10 sur 44 en math&eacute;matiques, 6 sur 58 en Lettres et Latin 5 sur 7 en langues, 3 sur 10 en sciences humaines, 1 sur 2 en arts plastiques, 1 sur 4 en musique, 7 sur 26 en sciences physiques et naturelles, 2 sur 15 interdisciplinaires). Cet effort est-il compatible avec le souci d'encourager et de d&eacute;velopper une production dans les 84<SMALL><SUP> </SUP></SMALL>coll&egrave;ges dont les logiciels &laquo;&nbsp;apportent un compl&eacute;ment indispensable &agrave; la biblioth&egrave;que du C.N.D.P.&nbsp;&raquo; (en 1983, 317 logiciels sont ainsi parvenus &agrave; la cellule informatique qui en a diffus&eacute; 44)&nbsp;?</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Enfin, si les 84 coll&egrave;ges exp&eacute;rimentaux re&ccedil;oivent un micro-ordinateur suppl&eacute;mentaire, le &laquo;&nbsp;saupoudrage&nbsp;&raquo; continue puisque 192 coll&egrave;ges se verraient attribuer un Micral 80-22 G (pour un sur deux, une imprimante) premier &eacute;l&eacute;ment d'une configuration &agrave; venir, compl&eacute;t&eacute;e en 1983-84 par quelques machines &laquo;&nbsp;bas de gamme&nbsp;&raquo;. Compte tenu des cr&eacute;dits de 1984 et des march&eacute;s ouverts par l'&Eacute;ducation nationale, le moment n'est-il pas venu de d&eacute;finir la ou les configurations informatiques choisies pour les coll&egrave;ges&nbsp;?</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Alors que le d&eacute;ploiement de l'informatique dans l'enseignement parait irr&eacute;versible, que les moyens budg&eacute;taires sont sensiblement accrus, l'administration des coll&egrave;ges semble encore souvent r&eacute;ticente, pour le moins tr&egrave;s prudente. Certes, &laquo;&nbsp;apr&egrave;s une p&eacute;riode plus ou moins longue de d&eacute;marrage&nbsp;&raquo; l'exp&eacute;rience des 84 coll&egrave;ges est lanc&eacute;e mais ne va-t-elle pas tr&egrave;s vite &ecirc;tre noy&eacute;e dans le d&eacute;veloppement informatique programm&eacute; par le Minist&egrave;re de l'&Eacute;ducation nationale&nbsp;?</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Qu'est-ce que 84 coll&egrave;ges et moins de 600 machines dans une perspective &agrave; cinq ans comportant 100&nbsp;000 micro-ordinateurs sur plus de 10&nbsp;000 sites&nbsp;? D&eacute;j&agrave;, en dehors des op&eacute;rations prises en charge par l'&Eacute;ducation nationale, on trouve beaucoup d'&eacute;quipements spontan&eacute;s, &laquo;&nbsp;sauvages&nbsp;&raquo;, tr&egrave;s disparates, beaucoup de coll&egrave;gues autodidactes, se formant &laquo;&nbsp;sur le tas&nbsp;&raquo;... et la demande d'informatique croit rapidement.</P>
<P ALIGN="JUSTIFY">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Le risque de confusion est grand que renforcent les h&eacute;sitations sur les objectifs, les contenus, la dur&eacute;e des formations (qu'attendre de formations l&eacute;g&egrave;res de 36 &agrave; 75 heures&nbsp;? Que feront les &laquo;&nbsp;form&eacute;s&nbsp;&raquo; et avec quels moyens&nbsp;?...), sur les &eacute;quipements, leur composition, leur r&eacute;partition... L'indispensable coordination ne peut &ecirc;tre assur&eacute;e par quelques r&eacute;unions de deux jours trop espac&eacute;es dans le temps (en d&eacute;cembre 1981, en juin 1982&nbsp;; et en mai 1983 il s'agit de stages th&eacute;matiques interacad&eacute;miques pour les seuls coll&egrave;ges exp&eacute;rimentaux) et la cellule informatique n'a pas assez de moyens pour assurer toutes les interfaces aux diff&eacute;rents plans national, acad&eacute;mique et d&eacute;partemental.</P>
<P ALIGN="RIGHT">Le 26 Janvier 1984.</P>
<P ALIGN="JUSTIFY">Pour cet historique, la <I>bibliographie de premi&egrave;re main</I> est constitu&eacute;e</P>

<UL>
<LI><P ALIGN="JUSTIFY">des publications de la Section Informatique et Enseignement de l'I.N.R.(D.)P.</P></LI><!/UL>

<UL>
<LI><P ALIGN="JUSTIFY">bulletin de liaison&nbsp;: 15 num&eacute;ros d'octobre 1971 &agrave; d&eacute;cembre 1978, deux suppl&eacute;ments (d&eacute;cembre 1976 et avril 1977), un num&eacute;ro sp&eacute;cial (d&eacute;cembre 1976).</P></LI>
<LI><P ALIGN="JUSTIFY">notes d'information&nbsp;: sept de janvier 1975 &agrave; avril 1979.</P></LI>
</UL>

<!UL>
<LI><P ALIGN="JUSTIFY">des publications de l'E.P.I.</P></LI>
<!/UL>


<UL>
<LI><P ALIGN="JUSTIFY">bulletin&nbsp;: 17 num&eacute;ros de 1971 &agrave; 1978 (n&deg;&nbsp;1 du 1er trimestre 1971-1972), trimestriel depuis le 1er trimestre 1981 (n&deg;&nbsp;21) avec un num&eacute;ro sp&eacute;cial annuel.</P></LI>
<LI><P ALIGN="JUSTIFY">lettres d'information du Bureau national.</P></LI>
</UL>
</UL>

<P ALIGN="JUSTIFY">Paru dans <I><B>&laquo;&nbsp;L'informatique au coll&egrave;ge&nbsp;&raquo;</B></I>, Dossier EPI n&deg;&nbsp;4, suppl&eacute;ment au Bulletin de mars 1984.</P>
<P><FONT SIZE=2>___________________<BR>
Association EPI</FONT></P>


</TD>
</TR>
</TABLE>
</CENTER>



<P ALIGN="CENTER">



<A NAME="FIN"></A>
<!--
<P ALIGN="CENTER"><A HREF="toto.htm#d04p005">Retour</A></P>
-->

</BODY>
</HTML>


